def my_bank_account():
    """
    Программа "Мой банковский счёт"
    Описание работы программы:
    Пользователь запускает программу у него на счету 0
    Программа предлагает следующие варианты действий
    1. пополнить счет
    2. покупка
    3. история покупок
    4. выход

    1. пополнение счета
    при выборе этого пункта пользователю предлагается ввести сумму на сколько пополнить счет
    после того как пользователь вводит сумму она добавляется к счету
    снова попадаем в основное меню

    2. покупка
    при выборе этого пункта пользователю предлагается ввести сумму покупки
    если она больше количества денег на счете, то сообщаем что денег не хватает и переходим в основное меню
    если денег достаточно предлагаем пользователю ввести название покупки, например (еда)
    снимаем деньги со счета
    сохраняем покупку в историю
    выходим в основное меню

    3. история покупок
    выводим историю покупок пользователя (название и сумму)
    возвращаемся в основное меню

    4. выход
    выход из программы
    """

    account = 0
    number_purchase = 0
    history_purchase = dict()

    print()
    print('"Мой банковский счёт"')
    while True:
        print()
        print('1. пополнение счета')
        print('2. покупка')
        print('3. история покупок')
        print('4. выход')
        print()
        choice = input('Выберите пункт меню: ')
        if choice == '1':
            cash = float(input('Введите сумму для пополнения счёта: '))
            account += cash
        elif choice == '2':
            purchase = float(input('Введите сумму покупки: '))
            if purchase > account:
                print('У Вас на счету недостаточно средств. Пополните счёт.')
                continue
            else:
                name_purchase = input('Введите название покупки: ')
                number_purchase += 1
                account -= purchase
                history_purchase[number_purchase] = {name_purchase: purchase}
        elif choice == '3':
            for item in list(iter(history_purchase)):
                purchase_name = list(history_purchase[item].keys())
                price = list(history_purchase[item].values())
                print(f'{item}) {purchase_name[0]} - {price[0]} руб.')
        elif choice == '4':
            break
        else:
            print('Неверный пункт меню')
